todo_app/app/controllers/api/todos_controller.rb

SELECT  "todos".* FROM "todos" WHERE "todos"."id" = $1 LIMIT $2  [["id", 5], ["LIMIT", 1]]
UPDATE "todos" SET "body" = $1, "updated_at" = $2 WHERE "todos"."id" = $3  [["body", "old food"], ["updated_at", "2021-10-21 18:45:15.081866"], ["id", 5]]
---
    def update
        @todo = Todo.find(params[:id])

        if @todo.update_attributes(todo_params)

SELECT  "todos".* FROM "todos" WHERE "todos"."id" = $1 LIMIT $2  [["id", 5], ["LIMIT", 1]]
DELETE FROM "todos" WHERE "todos"."id" = $1  [["id", 5]]
---
    def destroy
        @todo = Todo.find(params[:id])

        if @todo
            @todo.delete